wyniki_50G_article/fio_results_btrfs_nvme/block_size_16384/lab-sec-14/fio_seq_read_article_test_output.txt
seq_read_article_test: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
fio-3.36
Starting 1 process
seq_read_article_test: Laying out IO file (1 file / 51200MiB)

seq_read_article_test: (groupid=0, jobs=1): err= 0: pid=102368: Mon Apr 21 09:56:03 2025
  read: IOPS=10.3k, BW=40.4MiB/s (42.3MB/s)(7264MiB/180001msec)
    slat (nsec): min=3532, max=94064, avg=18934.87, stdev=9426.51
    clat (usec): min=19, max=18093, avg=76.16, stdev=49.29
     lat (usec): min=32, max=18138, avg=95.10, stdev=52.85
    clat percentiles (usec):
     |  1.00th=[   37],  5.00th=[   39], 10.00th=[   44], 20.00th=[   57],
     | 30.00th=[   62], 40.00th=[   63], 50.00th=[   64], 60.00th=[   74],
     | 70.00th=[   94], 80.00th=[   99], 90.00th=[  115], 95.00th=[  129],
     | 99.00th=[  180], 99.50th=[  200], 99.90th=[  229], 99.95th=[  243],
     | 99.99th=[  277]
   bw (  KiB/s): min=23472, max=72480, per=100.00%, avg=41354.61, stdev=10764.06, samples=359
   iops        : min= 5868, max=18120, avg=10338.66, stdev=2691.01, samples=359
  lat (usec)   : 20=0.01%, 50=17.92%, 100=64.40%, 250=17.66%, 500=0.03%
  lat (usec)   : 1000=0.01%
  lat (msec)   : 20=0.01%
  cpu          : usr=4.37%, sys=25.93%, ctx=1859575, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1859557,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=40.4MiB/s (42.3MB/s), 40.4MiB/s-40.4MiB/s (42.3MB/s-42.3MB/s), io=7264MiB (7617MB), run=180001-180001msec